balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F26K80.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00010001" edc:name="RXFBCON2" edc:nzwidth="0x8" edc:por="00010001">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F4BP" edc:desc="" edc:mask="0xf" edc:name="F4BP" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="F5BP" edc:desc="" edc:mask="0xf" edc:name="F5BP" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="F4BP_0" edc:desc="" edc:mask="0x1" edc:name="F4BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F4BP_1" edc:desc="" edc:mask="0x1" edc:name="F4BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F4BP_2" edc:desc="" edc:mask="0x1" edc:name="F4BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F4BP_3" edc:desc="" edc:mask="0x1" edc:name="F4BP_3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F5BP_0" edc:desc="" edc:mask="0x1" edc:name="F5BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F5BP_1" edc:desc="" edc:mask="0x1" edc:name="F5BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F5BP_2" edc:desc="" edc:mask="0x1" edc:name="F5BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F5BP_3" edc:desc="" edc:mask="0x1" edc:name="F5BP_3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFBCON3" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F6BP" edc:desc="" edc:mask="0xf" edc:name="F6BP" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="F7BP" edc:desc="" edc:mask="0xf" edc:name="F7BP" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="F6BP_0" edc:desc="" edc:mask="0x1" edc:name="F6BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F6BP_1" edc:desc="" edc:mask="0x1" edc:name="F6BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F6BP_2" edc:desc="" edc:mask="0x1" edc:name="F6BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F6BP_3" edc:desc="" edc:mask="0x1" edc:name="F6BP_3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F7BP_0" edc:desc="" edc:mask="0x1" edc:name="F7BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F7BP_1" edc:desc="" edc:mask="0x1" edc:name="F7BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F7BP_2" edc:desc="" edc:mask="0x1" edc:name="F7BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F7BP_3" edc:desc="" edc:mask="0x1" edc:name="F7BP_3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFBCON4" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F8BP" edc:desc="" edc:mask="0xf" edc:name="F8BP" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="F9BP" edc:desc="" edc:mask="0xf" edc:name="F9BP" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="F8BP_0" edc:desc="" edc:mask="0x1" edc:name="F8BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F8BP_1" edc:desc="" edc:mask="0x1" edc:name="F8BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F8BP_2" edc:desc="" edc:mask="0x1" edc:name="F8BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F8BP_3" edc:desc="" edc:mask="0x1" edc:name="F8BP_3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F9BP_0" edc:desc="" edc:mask="0x1" edc:name="F9BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F9BP_1" edc:desc="" edc:mask="0x1" edc:name="F9BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F9BP_2" edc:desc="" edc:mask="0x1" edc:name="F9BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F9BP_3" edc:desc="" edc:mask="0x1" edc:name="F9BP_3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFBCON5" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F10BP" edc:desc="" edc:mask="0xf" edc:name="F10BP" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="F11BP" edc:desc="" edc:mask="0xf" edc:name="F11BP" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="F10BP_0" edc:desc="" edc:mask="0x1" edc:name="F10BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F10BP_1" edc:desc="" edc:mask="0x1" edc:name="F10BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F10BP_2" edc:desc="" edc:mask="0x1" edc:name="F10BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F10BP_3" edc:desc="" edc:mask="0x1" edc:name="F10BP_3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F11BP_0" edc:desc="" edc:mask="0x1" edc:name="F11BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F11BP_1" edc:desc="" edc:mask="0x1" edc:name="F11BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F11BP_2" edc:desc="" edc:mask="0x1" edc:name="F11BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F11BP_3" edc:desc="" edc:mask="0x1" edc:name="F11BP_3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFBCON6" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F12BP" edc:desc="" edc:mask="0xf" edc:name="F12BP" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="F13BP" edc:desc="" edc:mask="0xf" edc:name="F13BP" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="F12BP_0" edc:desc="" edc:mask="0x1" edc:name="F12BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F12BP_1" edc:desc="" edc:mask="0x1" edc:name="F12BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F12BP_2" edc:desc="" edc:mask="0x1" edc:name="F12BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F12BP_3" edc:desc="" edc:mask="0x1" edc:name="F12BP_3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F13BP_0" edc:desc="" edc:mask="0x1" edc:name="F13BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F13BP_1" edc:desc="" edc:mask="0x1" edc:name="F13BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F13BP_2" edc:desc="" edc:mask="0x1" edc:name="F13BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F13BP_3" edc:desc="" edc:mask="0x1" edc:name="F13BP_3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFBCON7" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F14BP" edc:desc="" edc:mask="0xf" edc:name="F14BP" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="F15BP" edc:desc="" edc:mask="0xf" edc:name="F15BP" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="F14BP_0" edc:desc="" edc:mask="0x1" edc:name="F14BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F14BP_1" edc:desc="" edc:mask="0x1" edc:name="F14BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F14BP_2" edc:desc="" edc:mask="0x1" edc:name="F14BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F14BP_3" edc:desc="" edc:mask="0x1" edc:name="F14BP_3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F15BP_0" edc:desc="" edc:mask="0x1" edc:name="F15BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F15BP_1" edc:desc="" edc:mask="0x1" edc:name="F15BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F15BP_2" edc:desc="" edc:mask="0x1" edc:name="F15BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F15BP_3" edc:desc="" edc:mask="0x1" edc:name="F15BP_3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
