balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F26K80.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D0" edc:desc="" edc:mask="0xff" edc:name="TXB2D0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB2D00" edc:desc="" edc:mask="0x1" edc:name="TXB2D00" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D01" edc:desc="" edc:mask="0x1" edc:name="TXB2D01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D02" edc:desc="" edc:mask="0x1" edc:name="TXB2D02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D03" edc:desc="" edc:mask="0x1" edc:name="TXB2D03" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D04" edc:desc="" edc:mask="0x1" edc:name="TXB2D04" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D05" edc:desc="" edc:mask="0x1" edc:name="TXB2D05" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D06" edc:desc="" edc:mask="0x1" edc:name="TXB2D06" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D07" edc:desc="" edc:mask="0x1" edc:name="TXB2D07" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D1" edc:desc="" edc:mask="0xff" edc:name="TXB2D1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB2D10" edc:desc="" edc:mask="0x1" edc:name="TXB2D10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D11" edc:desc="" edc:mask="0x1" edc:name="TXB2D11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D12" edc:desc="" edc:mask="0x1" edc:name="TXB2D12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D13" edc:desc="" edc:mask="0x1" edc:name="TXB2D13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D14" edc:desc="" edc:mask="0x1" edc:name="TXB2D14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D15" edc:desc="" edc:mask="0x1" edc:name="TXB2D15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D16" edc:desc="" edc:mask="0x1" edc:name="TXB2D16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D17" edc:desc="" edc:mask="0x1" edc:name="TXB2D17" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D2" edc:desc="" edc:mask="0xff" edc:name="TXB2D2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB2D20" edc:desc="" edc:mask="0x1" edc:name="TXB2D20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D21" edc:desc="" edc:mask="0x1" edc:name="TXB2D21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D22" edc:desc="" edc:mask="0x1" edc:name="TXB2D22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D23" edc:desc="" edc:mask="0x1" edc:name="TXB2D23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D24" edc:desc="" edc:mask="0x1" edc:name="TXB2D24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D25" edc:desc="" edc:mask="0x1" edc:name="TXB2D25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D26" edc:desc="" edc:mask="0x1" edc:name="TXB2D26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D27" edc:desc="" edc:mask="0x1" edc:name="TXB2D27" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D3" edc:desc="" edc:mask="0xff" edc:name="TXB2D3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB2D30" edc:desc="" edc:mask="0x1" edc:name="TXB2D30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D31" edc:desc="" edc:mask="0x1" edc:name="TXB2D31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D32" edc:desc="" edc:mask="0x1" edc:name="TXB2D32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D33" edc:desc="" edc:mask="0x1" edc:name="TXB2D33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D34" edc:desc="" edc:mask="0x1" edc:name="TXB2D34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D35" edc:desc="" edc:mask="0x1" edc:name="TXB2D35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D36" edc:desc="" edc:mask="0x1" edc:name="TXB2D36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D37" edc:desc="" edc:mask="0x1" edc:name="TXB2D37" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
